# Statistics from Stock Data

구글, 애플, 아마존의 주식을 분석한다.

구글은 GOOG.csv 애플은 AAPL.csv 아마존은 AMZN.csv 파일에 주식 정보가 담겨있다.

다음 7개의 컬럼이 있다.

**Date Open High Low Close Adj_Close Volume**

csv 파일을 읽어서 DataFrame 으로 처리한다.

In [4]:
# 판다스를 임포트 한다.
import pandas as pd 

# GOOG.csv 파일을 판다스로 읽어서 저장한다.
google = pd.read_csv('GOOG.csv')

# 데이터의 처음 5줄을 화면에 출력한다.
google.head(5)

         Date       Open       High        Low      Close  Adj Close    Volume
0  2004-08-19  49.676899  51.693783  47.669952  49.845802  49.845802  44994500
1  2004-08-20  50.178635  54.187561  49.925285  53.805050  53.805050  23005800
2  2004-08-23  55.017166  56.373344  54.172661  54.346527  54.346527  18393200
3  2004-08-24  55.260582  55.439419  51.450363  52.096165  52.096165  15361800
4  2004-08-25  52.140873  53.651051  51.604362  52.657513  52.657513   9257400

## 세 회사의 상관관계를 분석한다.
## 각 csv 파일을 dataframe 으로 읽어와서 합친다.
## 이를 타임시리즈 data 라고 하며 간예측에 어떤지 분석에 사용한다.
## facebook 라이브러리 이용. ex) 농산물 가격 예측분석 , 트렌드 분석 (eg.가격)



# To Do

우리는, 각 date 에 해당되는 adj close 값만 관심이 있습니다. 따라서 컬럼은 두개만 사용하며, 이 두개 컬럼의 인덱스는 date로 만듭니다. 

hints:

* Use the `index_col` keyword to indicate which column you want to use as an index. For example `index_col = ['Open']`

* Set the `parse_dates` keyword equal to `True` to convert the Dates into real dates of the form year/month/day

* Use the `usecols` keyword to select which columns you want to load into the DataFrame. For example `usecols = ['Open', 'High']`

Fill in the code below:

In [5]:
# We load the Google stock data into a DataFrame
google_stock = pd.read_csv('GOOG.csv' , index_col= 'Date' , parse_dates=True , usecols= ['Date', 'Adj Close'])

In [6]:
google_stock.head(6)

            Adj Close
Date
2004-08-19  49.845802
2004-08-20  53.805050
2004-08-23  54.346527
2004-08-24  52.096165
2004-08-25  52.657513
2004-08-26  53.606342

In [7]:
# We load the Apple stock data into a DataFrame
apple_stock =   pd.read_csv('AAPL.csv' , index_col= 'Date' , parse_dates=True , usecols= ['Date', 'Adj Close'])

apple_stock.head(6)

            Adj Close
Date
2000-01-03   3.596616
2000-01-04   3.293384
2000-01-05   3.341579
2000-01-06   3.052405
2000-01-07   3.196992
2000-01-10   3.140763

In [8]:
# We load the Amazon stock data into a DataFrame
amazon_stock = pd.read_csv('AMZN.csv' , index_col= 'Date' , parse_dates=True , usecols= ['Date', 'Adj Close'])

amazon_stock.head(6)

            Adj Close
Date
2000-01-03    89.3750
2000-01-04    81.9375
2000-01-05    69.7500
2000-01-06    65.5625
2000-01-07    69.5625
2000-01-10    69.1875

`2000-01-01`  부터  `2016-12-31`년 까지의 데이터를 처리할것인데  `pd.date_range()` 함수를 이용해서 dates 변수를 만든다.
그리고 나서 위의  dates 를 인덱스로 하여, 새로 all_stocks 란 데이터프레임을 만든다.

In [9]:
# We create calendar dates between '2000-01-01' and  '2016-12-31'
dates = pd.date_range( '2000-01-01' , '2016-12-31')

In [10]:
# We create and empty DataFrame that uses the above dates as indices
all_stocks = pd.DataFrame(index = dates)
all_stocks

Empty DataFrame
Columns: []
Index: [2000-01-01 00:00:00, 2000-01-02 00:00:00, 2000-01-03 00:00:00, 2000-01-04 00:00:00, 2000-01-05 00:00:00, 2000-01-06 00:00:00, 2000-01-07 00:00:00, 2000-01-08 00:00:00, 2000-01-09 00:00:00, 2000-01-10 00:00:00, 2000-01-11 00:00:00, 2000-01-12 00:00:00, 2000-01-13 00:00:00, 2000-01-14 00:00:00, 2000-01-15 00:00:00, 2000-01-16 00:00:00, 2000-01-17 00:00:00, 2000-01-18 00:00:00, 2000-01-19 00:00:00, 2000-01-20 00:00:00, 2000-01-21 00:00:00, 2000-01-22 00:00:00, 2000-01-23 00:00:00, 2000-01-24 00:00:00, 2000-01-25 00:00:00, 2000-01-26 00:00:00, 2000-01-27 00:00:00, 2000-01-28 00:00:00, 2000-01-29 00:00:00, 2000-01-30 00:00:00, 2000-01-31 00:00:00, 2000-02-01 00:00:00, 2000-02-02 00:00:00, 2000-02-03 00:00:00, 2000-02-04 00:00:00, 2000-02-05 00:00:00, 2000-02-06 00:00:00, 2000-02-07 00:00:00, 2000-02-08 00:00:00, 2000-02-09 00:00:00, 2000-02-10 00:00:00, 2000-02-11 00:00:00, 2000-02-12 00:00:00, 2000-02-13 00:00:00, 2000-02-14 00:00:00, 2000-02-15 00:00:00, 2000-02-16 00:00:00, 2000-02-17 00:00:00, 2000-02-18 00:00:00, 2000-02-19 00:00:00, 2000-02-20 00:00:00, 2000-02-21 00:00:00, 2000-02-22 00:00:00, 2000-02-23 00:00:00, 2000-02-24 00:00:00, 2000-02-25 00:00:00, 2000-02-26 00:00:00, 2000-02-27 00:00:00, 2000-02-28 00:00:00, 2000-02-29 00:00:00, 2000-03-01 00:00:00, 2000-03-02 00:00:00, 2000-03-03 00:00:00, 2000-03-04 00:00:00, 2000-03-05 00:00:00, 2000-03-06 00:00:00, 2000-03-07 00:00:00, 2000-03-08 00:00:00, 2000-03-09 00:00:00, 2000-03-10 00:00:00, 2000-03-11 00:00:00, 2000-03-12 00:00:00, 2000-03-13 00:00:00, 2000-03-14 00:00:00, 2000-03-15 00:00:00, 2000-03-16 00:00:00, 2000-03-17 00:00:00, 2000-03-18 00:00:00, 2000-03-19 00:00:00, 2000-03-20 00:00:00, 2000-03-21 00:00:00, 2000-03-22 00:00:00, 2000-03-23 00:00:00, 2000-03-24 00:00:00, 2000-03-25 00:00:00, 2000-03-26 00:00:00, 2000-03-27 00:00:00, 2000-03-28 00:00:00, 2000-03-29 00:00:00, 2000-03-30 00:00:00, 2000-03-31 00:00:00, 2000-04-01 00:00:00, 2000-04-02 00:00:00, 2000-04-03 00:00:00, 2000-04-04 00:00:00, 2000-04-05 00:00:00, 2000-04-06 00:00:00, 2000-04-07 00:00:00, 2000-04-08 00:00:00, 2000-04-09 00:00:00, ...]

[6210 rows x 0 columns]

# To Do

각 `google_stock`, `apple_stock`, `amazon_stock`, 을,  `all_stocks` 의 날짜에 매칭하여 수정종가를 나오게 한다.

all_stocks와 각각의 데이터프레임을 join 한다. 그러나 먼저, 현재의 구글,애플, 아마존의 DataFrame에 있는 컬럼명을, 각각의 수정종가로 표현하기 위해, 각각의 adj close 를 google_stock, apple_stock, amazon_stock 로 바꾼다.

`pd.DataFrame.rename()` 함수를 이용.

In [11]:
# Change the Adj Close column label to Google
google_stock =  google_stock.rename(columns={'Adj Close' : 'google_stock'})

# Change the Adj Close column label to Apple
apple_stock =   apple_stock.rename(columns={'Adj Close': 'apple_stock'})

# Change the Adj Close column label to Amazon
amazon_stock =   amazon_stock.rename(columns={'Adj Close': 'amazon_stock'})

In [12]:
# We display the google_stock DataFrame
google_stock

            google_stock
Date
2004-08-19     49.845802
2004-08-20     53.805050
2004-08-23     54.346527
2004-08-24     52.096165
2004-08-25     52.657513
...                  ...
2017-10-09    977.000000
2017-10-10    972.599976
2017-10-11    989.250000
2017-10-12    987.830017
2017-10-13    989.679993

[3313 rows x 1 columns]

In [13]:
# We display the apple_stock DataFrame

In [14]:
# We display the amazon_stock DataFrame

이제 `all_stocks` DataFrame 를 기준으로, 각각의 구글,애플,아마존의 데이터프레임을 합친다.

`dataframe.join()` 함수를 이용.
`dataframe1.join(dataframe2)`  `dataframe1` 을 기준으로 `dataframe2`를 합치는 함수이다.

In [15]:
# We join the Google stock to all_stocks
all_stocks =  all_stocks.join(google_stock)

In [16]:
# We join the Apple stock to all_stocks
all_stocks =  all_stocks.join(apple_stock)

In [17]:
# We join the Amazon stock to all_stocks
all_stocks =  all_stocks.join(amazon_stock)

 `all_stocks`  를 앞에서 10줄 출력하여 확인하세요.

In [18]:
all_stocks.head(10)

            google_stock  apple_stock  amazon_stock
2000-01-01           NaN          NaN           NaN
2000-01-02           NaN          NaN           NaN
2000-01-03           NaN     3.596616       89.3750
2000-01-04           NaN     3.293384       81.9375
2000-01-05           NaN     3.341579       69.7500
2000-01-06           NaN     3.052405       65.5625
2000-01-07           NaN     3.196992       69.5625
2000-01-08           NaN          NaN           NaN
2000-01-09           NaN          NaN           NaN
2000-01-10           NaN     3.140763       69.1875

# To Do

해당 년도의 데이터가 없는 경우가 있다. 즉, 데이터가 NaN 으로 나오면 해당년도 데이터가 없는것이다.
그러므로 NaN이 포함되어 있는지 먼저 확인한다.

In [19]:
# Check if there are any NaN values in the all_stocks dataframe

In [20]:
all_stocks.isna().sum()

google_stock    3095
apple_stock     1933
amazon_stock    1933
dtype: int64

NaN 값을 포함하는 행은 제거한다.

In [21]:
# Remove any rows that contain NaN values

all_stocks =   all_stocks.dropna()

 `all_stocks`  에 NaN 이 없어졌는지 체크한다.

In [ ]:
# Check if there are any NaN values in the all_stocks dataframe

In [64]:
all_stocks.isna().sum()

google_stock    0
apple_stock     0
amazon_stock    0
dtype: int64

 `all_stocks`  출력.

In [ ]:
# We display the all_stocks DataFrame

## 이제 통계데이터를 확인한다.

In [72]:
# 각 스톡의 평균을 출력

all_stocks.mean()

google_stock    347.420229
apple_stock      47.736018
amazon_stock    216.598177
dtype: float64

In [65]:
# 각 스톡의 표준편차를 출력

all_stocks.std()

google_stock    187.671596
apple_stock      37.421555
amazon_stock    199.129792
dtype: float64

In [ ]:
# 2010 년부터 2014년까지의 주식의 평균과 표쥰편차?

In [74]:
df_new = all_stocks.loc[  '2010-01-01':'2014-12-31' ,   ]

In [66]:
all_stocks.head(3)

            google_stock  apple_stock  amazon_stock
2004-08-19     49.845802     1.973460     38.630001
2004-08-20     53.805050     1.979244     39.509998
2004-08-23     54.346527     1.997236     39.450001

In [70]:
all_stocks.loc[  '2010-01-01':'2014-12-31' ,   ].mean()

google_stock    373.204694
apple_stock      60.667288
amazon_stock    237.366821
dtype: float64

In [71]:
all_stocks.loc[  '2010-01-01':'2014-12-31' ,   ].std()

google_stock    115.018544
apple_stock      20.658444
amazon_stock     75.329963
dtype: float64

## 각 stock의 correlation (상관관계)을 출력

각 컬럼간의 관계 분석
 e.g.구글이 오를때 아마존을 살까 애플을 살까?

상관관계 즉 컬럼관계로 추천 시스템 만든다.
 < 비례, 반비례 , 무관계 분석 >

숫자 즉 상관계수가 지표가 돼서 그것을 이용한다.
그것을 함수로 구해서 분석한다.

In [73]:
all_stocks.corr()  # 상관계수 뽑아주는 함수 .대각선은 무의미. 어퍼나 로우 바운드 중 하나만 보면됨. 대창구조

              google_stock  apple_stock  amazon_stock
google_stock      1.000000     0.900242      0.952444
apple_stock       0.900242     1.000000      0.886321
amazon_stock      0.952444     0.886321      1.000000

In [75]:
df_new.corr()  # 2010~ 2014

              google_stock  apple_stock  amazon_stock
google_stock      1.000000     0.728963      0.919923
apple_stock       0.728963     1.000000      0.756024
amazon_stock      0.919923     0.756024      1.000000